<a href="https://colab.research.google.com/github/UznetDev/Data-science-home-work/blob/main/29_Avg_2024.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQL Window function 2**

### Import librares

In [70]:
import pandas as pd

### Set-up for SQL

In [71]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

##### Load dataset

In [72]:
summer = pd.read_csv('summer.csv')

##### Upload dataset to SQL

In [73]:
%sql DROP TABLE IF EXISTS summer;
%sql --persist summer

 * sqlite://
Done.
 * sqlite://

'Persisted summer'

##### View all table

In [74]:
%%sql SELECT * FROM summer LIMIT 1;

 * sqlite://
Done.

[(0, 1896, 'Athens', 'Aquatics', 'Swimming', 'HAJOS Alfred', 'HUN', 'Men', '100M Freestyle', 'Gold')]

### Class work

#### Part 1 (*`OVER` Window function*)

In [75]:
%%sql
WITH Country_Gold AS (
  SELECT
    DISTINCT Year, Country, Event
  FROM summer
  WHERE Year IN (2008, 2012)
  AND Country IN ('CHN', 'JPN')
  AND Gender='Women'
  AND Medal='Gold'
)

SELECT
  Year, Country, Event,
  ROW_NUMBER() OVER(PARTITION BY Year, Country) AS ROW_NUMBER
FROM Country_Gold;

 * sqlite://
Done.

[(2008, 'CHN', '10M Platform', 1),
 (2008, 'CHN', '3M Springboard', 2),
 (2008, 'CHN', 'Synchronized Diving 10M Platform', 3),
 (2008, 'CHN', 'Synchronized Diving 3M Springboard', 4),
 (2008, 'CHN', '200M Butterfly', 5),
 (2008, 'CHN', 'Individual (Fita Olympic Round - 70M)', 6),
 (2008, 'CHN', 'Doubles', 7),
 (2008, 'CHN', 'Singles', 8),
 (2008, 'CHN', 'Team Competition', 9),
 (2008, 'CHN', 'Uneven Bars', 10),
 (2008, 'CHN', 'Individual', 11),
 (2008, 'CHN', '+ 78KG (Heavyweight)', 12),
 (2008, 'CHN', '48 - 52KG (Half-Lightweight)', 13),
 (2008, 'CHN', '70 - 78KG (Half-Heavyweight)', 14),
 (2008, 'CHN', 'Quadruple Sculls Without Coxswain (4X)', 15),
 (2008, 'CHN', 'Rs:X - Windsurfer', 16),
 (2008, 'CHN', '10M Air Pistol (40 Shots)', 17),
 (2008, 'CHN', '25M Pistol (30+30 Shots)', 18),
 (2008, 'CHN', '50M Rifle 3 Positions (3X20 Shots)', 19),
 (2008, 'CHN', 'Team', 20),
 (2008, 'CHN', '- 49 KG', 21),
 (2008, 'CHN', '48KG', 22),
 (2008, 'CHN', '58KG', 23),
 (2008, 'CHN', '69KG', 24),
 (2008, 'CHN', '75KG', 25),
 (2008, 'CHN', '63 - 72KG', 26),
 (2008, 'JPN', '57 - 63KG (Half-Middleweight)', 1),
 (2008, 'JPN', '63 - 70KG (Middleweight)', 2),
 (2008, 'JPN', 'Softball', 3),
 (2008, 'JPN', '48 - 55KG', 4),
 (2008, 'JPN', '55 - 63KG', 5),
 (2012, 'CHN', '10M Platform', 1),
 (2012, 'CHN', '3M Springboard', 2),
 (2012, 'CHN', 'Synchronized 10M', 3),
 (2012, 'CHN', 'Synchronized 3M', 4),
 (2012, 'CHN', '200M Butterfly', 5),
 (2012, 'CHN', '200M Medley', 6),
 (2012, 'CHN', '400M Medley', 7),
 (2012, 'CHN', 'Doubles', 8),
 (2012, 'CHN', 'Singles', 9),
 (2012, 'CHN', 'Épée Team', 10),
 (2012, 'CHN', 'Beam', 11),
 (2012, 'CHN', 'Laser Radial', 12),
 (2012, 'CHN', '10M Air Pistol', 13),
 (2012, 'CHN', '10M Air Rifle', 14),
 (2012, 'CHN', 'Team', 15),
 (2012, 'CHN', '- 49 KG', 16),
 (2012, 'CHN', '+75KG', 17),
 (2012, 'CHN', '48KG', 18),
 (2012, 'CHN', '58KG', 19),
 (2012, 'JPN', '52 - 57KG', 1),
 (2012, 'JPN', 'Wf 48 KG', 2),
 (2012, 'JPN', 'Wf 55 KG', 3),
 (2012, 'JPN', 'Wf 63 KG', 4)]

In [76]:
%%sql
WITH hosts AS (
  SELECT
    DISTINCT Year, City
  FROM summer
)

SELECT Year, City,
       LEAD(City) OVER(ORDER BY Year) AS next_yaer,
       LEAD(City, 2) OVER(ORDER BY Year) AS after_next_yaer
FROM hosts
ORDER BY Year;

 * sqlite://
Done.

[(1896, 'Athens', 'Paris', 'St Louis'),
 (1900, 'Paris', 'St Louis', 'London'),
 (1904, 'St Louis', 'London', 'Stockholm'),
 (1908, 'London', 'Stockholm', 'Antwerp'),
 (1912, 'Stockholm', 'Antwerp', 'Paris'),
 (1920, 'Antwerp', 'Paris', 'Amsterdam'),
 (1924, 'Paris', 'Amsterdam', 'Los Angeles'),
 (1928, 'Amsterdam', 'Los Angeles', 'Berlin'),
 (1932, 'Los Angeles', 'Berlin', 'London'),
 (1936, 'Berlin', 'London', 'Helsinki'),
 (1948, 'London', 'Helsinki', 'Melbourne / Stockholm'),
 (1952, 'Helsinki', 'Melbourne / Stockholm', 'Rome'),
 (1956, 'Melbourne / Stockholm', 'Rome', 'Tokyo'),
 (1960, 'Rome', 'Tokyo', 'Mexico'),
 (1964, 'Tokyo', 'Mexico', 'Munich'),
 (1968, 'Mexico', 'Munich', 'Montreal'),
 (1972, 'Munich', 'Montreal', 'Moscow'),
 (1976, 'Montreal', 'Moscow', 'Los Angeles'),
 (1980, 'Moscow', 'Los Angeles', 'Seoul'),
 (1984, 'Los Angeles', 'Seoul', 'Barcelona'),
 (1988, 'Seoul', 'Barcelona', 'Atlanta'),
 (1992, 'Barcelona', 'Atlanta', 'Sydney'),
 (1996, 'Atlanta', 'Sydney', 'Athens'),
 (2000, 'Sydney', 'Athens', 'Beijing'),
 (2004, 'Athens', 'Beijing', 'London'),
 (2008, 'Beijing', 'London', None),
 (2012, 'London', None, None)]

In [77]:
%%sql
WITH hosts AS (
  SELECT
    DISTINCT Year, City
  FROM summer
)

SELECT
  Year, City,
  FIRST_VALUE(City) OVER(
    ORDER BY Year
  ) AS first_cty,
  LAST_VALUE(City) OVER(
    ORDER BY Year
    RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
  ) AS last_cty

FROM hosts
ORDER BY Year;

 * sqlite://
Done.

[(1896, 'Athens', 'Athens', 'London'),
 (1900, 'Paris', 'Athens', 'London'),
 (1904, 'St Louis', 'Athens', 'London'),
 (1908, 'London', 'Athens', 'London'),
 (1912, 'Stockholm', 'Athens', 'London'),
 (1920, 'Antwerp', 'Athens', 'London'),
 (1924, 'Paris', 'Athens', 'London'),
 (1928, 'Amsterdam', 'Athens', 'London'),
 (1932, 'Los Angeles', 'Athens', 'London'),
 (1936, 'Berlin', 'Athens', 'London'),
 (1948, 'London', 'Athens', 'London'),
 (1952, 'Helsinki', 'Athens', 'London'),
 (1956, 'Melbourne / Stockholm', 'Athens', 'London'),
 (1960, 'Rome', 'Athens', 'London'),
 (1964, 'Tokyo', 'Athens', 'London'),
 (1968, 'Mexico', 'Athens', 'London'),
 (1972, 'Munich', 'Athens', 'London'),
 (1976, 'Montreal', 'Athens', 'London'),
 (1980, 'Moscow', 'Athens', 'London'),
 (1984, 'Los Angeles', 'Athens', 'London'),
 (1988, 'Seoul', 'Athens', 'London'),
 (1992, 'Barcelona', 'Athens', 'London'),
 (1996, 'Atlanta', 'Athens', 'London'),
 (2000, 'Sydney', 'Athens', 'London'),
 (2004, 'Athens', 'Athens', 'London'),
 (2008, 'Beijing', 'Athens', 'London'),
 (2012, 'London', 'Athens', 'London')]

In [78]:
%%sql
WITH hosts AS (
  SELECT
    DISTINCT Year, City
  FROM summer
)

SELECT
  Year, City,
  FIRST_VALUE(City) OVER(
    ORDER BY Year
  ) AS first_cty,
  LAST_VALUE(City) OVER(
    ORDER BY Year
    ROWS BETWEEN UNBOUNDED PRECEDING
    AND UNBOUNDED FOLLOWING
  ) AS last_cty

FROM hosts
ORDER BY Year;

 * sqlite://
Done.

[(1896, 'Athens', 'Athens', 'London'),
 (1900, 'Paris', 'Athens', 'London'),
 (1904, 'St Louis', 'Athens', 'London'),
 (1908, 'London', 'Athens', 'London'),
 (1912, 'Stockholm', 'Athens', 'London'),
 (1920, 'Antwerp', 'Athens', 'London'),
 (1924, 'Paris', 'Athens', 'London'),
 (1928, 'Amsterdam', 'Athens', 'London'),
 (1932, 'Los Angeles', 'Athens', 'London'),
 (1936, 'Berlin', 'Athens', 'London'),
 (1948, 'London', 'Athens', 'London'),
 (1952, 'Helsinki', 'Athens', 'London'),
 (1956, 'Melbourne / Stockholm', 'Athens', 'London'),
 (1960, 'Rome', 'Athens', 'London'),
 (1964, 'Tokyo', 'Athens', 'London'),
 (1968, 'Mexico', 'Athens', 'London'),
 (1972, 'Munich', 'Athens', 'London'),
 (1976, 'Montreal', 'Athens', 'London'),
 (1980, 'Moscow', 'Athens', 'London'),
 (1984, 'Los Angeles', 'Athens', 'London'),
 (1988, 'Seoul', 'Athens', 'London'),
 (1992, 'Barcelona', 'Athens', 'London'),
 (1996, 'Atlanta', 'Athens', 'London'),
 (2000, 'Sydney', 'Athens', 'London'),
 (2004, 'Athens', 'Athens', 'London'),
 (2008, 'Beijing', 'Athens', 'London'),
 (2012, 'London', 'Athens', 'London')]

In [79]:
%%sql
SELECT
  Country,
  COUNT(DISTINCT Year) AS games
FROM summer
WHERE
  Country IN (
    'GBR', 'DEN', 'FRA',
    'ITA', 'AUT', 'BEL',
    'NOR', 'POL', 'ESP'
  )
GROUP BY Country
ORDER BY games DESC;

 * sqlite://
Done.

[('GBR', 27),
 ('FRA', 26),
 ('DEN', 26),
 ('ITA', 25),
 ('BEL', 24),
 ('AUT', 24),
 ('NOR', 22),
 ('POL', 20),
 ('ESP', 18)]

In [80]:
%%sql
WITH country_games AS (
  SELECT
    Country,
    COUNT(DISTINCT Year) AS games
  FROM summer
  WHERE
    Country IN (
      'GBR', 'DEN', 'FRA',
      'ITA', 'AUT', 'BEL',
      'NOR', 'POL', 'ESP'
    )
  GROUP BY Country
  ORDER BY games DESC
)
SELECT
  Country,
  games,
  ROW_NUMBER() OVER(ORDER BY games DESC) AS Row_Number
FROM country_games
ORDER BY games DESC, Country;

 * sqlite://
Done.

[('GBR', 27, 1),
 ('DEN', 26, 3),
 ('FRA', 26, 2),
 ('ITA', 25, 4),
 ('AUT', 24, 6),
 ('BEL', 24, 5),
 ('NOR', 22, 7),
 ('POL', 20, 8),
 ('ESP', 18, 9)]

In [81]:
%%sql
WITH country_games AS (
  SELECT
    Country,
    COUNT(DISTINCT Year) AS games
  FROM summer
  WHERE
    Country IN (
      'GBR', 'DEN', 'FRA',
      'ITA', 'AUT', 'BEL',
      'NOR', 'POL', 'ESP'
    )
  GROUP BY Country
  ORDER BY games DESC
)
SELECT
  Country,
  games,
  ROW_NUMBER() OVER(ORDER BY games DESC) AS Row_Number,
  RANK() OVER(ORDER BY games DESC) AS Rank,
  DENSE_RANK() OVER(ORDER BY games DESC) AS Dense_Rank
FROM country_games
ORDER BY games DESC, Country;

 * sqlite://
Done.

[('GBR', 27, 1, 1, 1),
 ('DEN', 26, 3, 2, 2),
 ('FRA', 26, 2, 2, 2),
 ('ITA', 25, 4, 4, 3),
 ('AUT', 24, 6, 5, 4),
 ('BEL', 24, 5, 5, 4),
 ('NOR', 22, 7, 7, 5),
 ('POL', 20, 8, 8, 6),
 ('ESP', 18, 9, 9, 7)]

In [82]:
%%sql
SELECT
  Country,
  Athlete,
  COUNT(*) AS Medals
FROM summer
WHERE Country IN ('CHN', 'RUS')
AND Year=2012
GROUP BY Country, Athlete
HAvING Medals > 1
ORDER BY Country, Medals DESC;

 * sqlite://
Done.

[('CHN', 'SUN Yang', 4),
 ('CHN', 'ZOU Kai', 3),
 ('CHN', 'WANG Hao', 3),
 ('CHN', 'GUO Shuang', 3),
 ('CHN', 'ZHAO Yunlei', 2),
 ('CHN', 'ZHANG Jike', 2),
 ('CHN', 'YE Shiwen', 2),
 ('CHN', 'WU Minxia', 2),
 ('CHN', 'SUN Yujie', 2),
 ('CHN', 'QIN Kai', 2),
 ('CHN', 'LIU Ou', 2),
 ('CHN', 'LI Xiaoxia', 2),
 ('CHN', 'HUANG Xuechen', 2),
 ('CHN', 'HE Zi', 2),
 ('CHN', 'FENG Zhe', 2),
 ('CHN', 'DING Ning', 2),
 ('CHN', 'CHEN Yibing', 2),
 ('CHN', 'CHEN Ruolin', 2),
 ('RUS', 'MUSTAFINA Aliya', 4),
 ('RUS', 'ZAKHAROV Ilya', 2),
 ('RUS', 'ZABELINSKAYA Olga', 2),
 ('RUS', 'ROMASHINA Svetlana', 2),
 ('RUS', 'PASEKA Maria', 2),
 ('RUS', 'KOMOVA Victoria', 2),
 ('RUS', 'ISHCHENKO Natalia', 2),
 ('RUS', 'ANTYUKH Natalya', 2),
 ('RUS', 'ABLYAZIN Denis', 2)]

In [83]:
%%sql
WITH country_medals AS (
  SELECT
    Country,
    Athlete,
    COUNT(*) AS Medals
  FROM summer
  WHERE Country IN ('CHN', 'RUS')
  AND Year=2012
  GROUP BY Country, Athlete
  HAVING Medals > 1
  ORDER BY Country, Medals DESC
)
SELECT
  Country,
  Athlete,
  Medals,
  DENSE_RANK() OVER(ORDER BY Medals DESC) AS Row_Number
FROM country_medals
ORDER BY Country, Medals DESC;

 * sqlite://
Done.

[('CHN', 'SUN Yang', 4, 1),
 ('CHN', 'ZOU Kai', 3, 2),
 ('CHN', 'WANG Hao', 3, 2),
 ('CHN', 'GUO Shuang', 3, 2),
 ('CHN', 'ZHAO Yunlei', 2, 3),
 ('CHN', 'ZHANG Jike', 2, 3),
 ('CHN', 'YE Shiwen', 2, 3),
 ('CHN', 'WU Minxia', 2, 3),
 ('CHN', 'SUN Yujie', 2, 3),
 ('CHN', 'QIN Kai', 2, 3),
 ('CHN', 'LIU Ou', 2, 3),
 ('CHN', 'LI Xiaoxia', 2, 3),
 ('CHN', 'HUANG Xuechen', 2, 3),
 ('CHN', 'HE Zi', 2, 3),
 ('CHN', 'FENG Zhe', 2, 3),
 ('CHN', 'DING Ning', 2, 3),
 ('CHN', 'CHEN Yibing', 2, 3),
 ('CHN', 'CHEN Ruolin', 2, 3),
 ('RUS', 'MUSTAFINA Aliya', 4, 1),
 ('RUS', 'ZAKHAROV Ilya', 2, 3),
 ('RUS', 'ZABELINSKAYA Olga', 2, 3),
 ('RUS', 'ROMASHINA Svetlana', 2, 3),
 ('RUS', 'PASEKA Maria', 2, 3),
 ('RUS', 'KOMOVA Victoria', 2, 3),
 ('RUS', 'ISHCHENKO Natalia', 2, 3),
 ('RUS', 'ANTYUKH Natalya', 2, 3),
 ('RUS', 'ABLYAZIN Denis', 2, 3)]

In [84]:
%%sql
WITH country_medals AS (
  SELECT
    Country,
    Athlete,
    COUNT(*) AS Medals
  FROM summer
  WHERE Country IN ('CHN', 'RUS')
  AND Year=2012
  GROUP BY Country, Athlete
  HAVING Medals > 1
  ORDER BY Country, Medals DESC
)
SELECT
  Country,
  Athlete,
  Medals,
  DENSE_RANK() OVER(PARTITION BY Country
    ORDER BY Medals DESC) AS Row_Number
FROM country_medals
ORDER BY Country, Medals DESC;

 * sqlite://
Done.

[('CHN', 'SUN Yang', 4, 1),
 ('CHN', 'ZOU Kai', 3, 2),
 ('CHN', 'WANG Hao', 3, 2),
 ('CHN', 'GUO Shuang', 3, 2),
 ('CHN', 'ZHAO Yunlei', 2, 3),
 ('CHN', 'ZHANG Jike', 2, 3),
 ('CHN', 'YE Shiwen', 2, 3),
 ('CHN', 'WU Minxia', 2, 3),
 ('CHN', 'SUN Yujie', 2, 3),
 ('CHN', 'QIN Kai', 2, 3),
 ('CHN', 'LIU Ou', 2, 3),
 ('CHN', 'LI Xiaoxia', 2, 3),
 ('CHN', 'HUANG Xuechen', 2, 3),
 ('CHN', 'HE Zi', 2, 3),
 ('CHN', 'FENG Zhe', 2, 3),
 ('CHN', 'DING Ning', 2, 3),
 ('CHN', 'CHEN Yibing', 2, 3),
 ('CHN', 'CHEN Ruolin', 2, 3),
 ('RUS', 'MUSTAFINA Aliya', 4, 1),
 ('RUS', 'ZAKHAROV Ilya', 2, 2),
 ('RUS', 'ZABELINSKAYA Olga', 2, 2),
 ('RUS', 'ROMASHINA Svetlana', 2, 2),
 ('RUS', 'PASEKA Maria', 2, 2),
 ('RUS', 'KOMOVA Victoria', 2, 2),
 ('RUS', 'ISHCHENKO Natalia', 2, 2),
 ('RUS', 'ANTYUKH Natalya', 2, 2),
 ('RUS', 'ABLYAZIN Denis', 2, 2)]

In [85]:
%%sql
WITH country_medals AS (
  SELECT
    Country,
    Athlete,
    COUNT(*) AS Medals
  FROM summer
  WHERE Country IN ('CHN', 'RUS')
  AND Year=2012
  GROUP BY Country, Athlete
  HAVING Medals > 1
  ORDER BY Country, Medals DESC
)
SELECT
  Country,
  Athlete,
  Medals,
  DENSE_RANK() OVER(PARTITION BY Country
    ORDER BY Medals DESC) AS Row_Number
FROM country_medals
ORDER BY Country, Medals DESC;

 * sqlite://
Done.

[('CHN', 'SUN Yang', 4, 1),
 ('CHN', 'ZOU Kai', 3, 2),
 ('CHN', 'WANG Hao', 3, 2),
 ('CHN', 'GUO Shuang', 3, 2),
 ('CHN', 'ZHAO Yunlei', 2, 3),
 ('CHN', 'ZHANG Jike', 2, 3),
 ('CHN', 'YE Shiwen', 2, 3),
 ('CHN', 'WU Minxia', 2, 3),
 ('CHN', 'SUN Yujie', 2, 3),
 ('CHN', 'QIN Kai', 2, 3),
 ('CHN', 'LIU Ou', 2, 3),
 ('CHN', 'LI Xiaoxia', 2, 3),
 ('CHN', 'HUANG Xuechen', 2, 3),
 ('CHN', 'HE Zi', 2, 3),
 ('CHN', 'FENG Zhe', 2, 3),
 ('CHN', 'DING Ning', 2, 3),
 ('CHN', 'CHEN Yibing', 2, 3),
 ('CHN', 'CHEN Ruolin', 2, 3),
 ('RUS', 'MUSTAFINA Aliya', 4, 1),
 ('RUS', 'ZAKHAROV Ilya', 2, 2),
 ('RUS', 'ZABELINSKAYA Olga', 2, 2),
 ('RUS', 'ROMASHINA Svetlana', 2, 2),
 ('RUS', 'PASEKA Maria', 2, 2),
 ('RUS', 'KOMOVA Victoria', 2, 2),
 ('RUS', 'ISHCHENKO Natalia', 2, 2),
 ('RUS', 'ANTYUKH Natalya', 2, 2),
 ('RUS', 'ABLYAZIN Denis', 2, 2)]

In [86]:
%%sql
SELECT
  DISTINCT Discipline
FROM summer

 * sqlite://
Done.

[('Swimming',),
 ('Athletics',),
 ('Cycling Road',),
 ('Cycling Track',),
 ('Fencing',),
 ('Artistic G.',),
 ('Shooting',),
 ('Tennis',),
 ('Weightlifting',),
 ('Wrestling Gre-R',),
 ('Water polo',),
 ('Archery',),
 ('Basque Pelota',),
 ('Cricket',),
 ('Croquet',),
 ('Jumping',),
 ('Football',),
 ('Golf',),
 ('Polo',),
 ('Rowing',),
 ('Rugby',),
 ('Sailing',),
 ('Tug of War',),
 ('Diving',),
 ('Boxing',),
 ('Lacrosse',),
 ('Roque',),
 ('Wrestling Free.',),
 ('Hockey',),
 ('Jeu de Paume',),
 ('Rackets',),
 ('Figure skating',),
 ('Water Motorspor',),
 ('Dressage',),
 ('Eventing',),
 ('Modern Pentath.',),
 ('Vaulting',),
 ('Ice Hockey',),
 ('Basketball',),
 ('Canoe / Kayak F',),
 ('Handball',),
 ('Judo',),
 ('Volleyball',),
 ('Canoe / Kayak S',),
 ('Synchronized S.',),
 ('Rhythmic G.',),
 ('Table Tennis',),
 ('Badminton',),
 ('Baseball',),
 ('Mountain Bike',),
 ('Softball',),
 ('Beach volley.',),
 ('Trampoline',),
 ('Taekwondo',),
 ('Triathlon',),
 ('BMX',),
 ('Marathon swimming',),
 ('Synchronized Swimming',),
 ('Water Polo',),
 ('Canoe Slalom',),
 ('Canoe Sprint',),
 ('Cycling BMX',),
 ('Gymnastics Artistic',),
 ('Gymnastics Rhythmic',),
 ('Modern Pentathlon',),
 ('Beach Volleyball',),
 ('Wrestling Freestyle',)]

In [87]:
%%sql
WITH d_discline AS (
  SELECT
    DISTINCT Discipline
  FROM summer
)
SELECT
  Discipline,
  NTILE(15) OVER() AS page
FROM d_discline
ORDER BY page;

 * sqlite://
Done.

[('Swimming', 1),
 ('Athletics', 1),
 ('Cycling Road', 1),
 ('Cycling Track', 1),
 ('Fencing', 1),
 ('Artistic G.', 2),
 ('Shooting', 2),
 ('Tennis', 2),
 ('Weightlifting', 2),
 ('Wrestling Gre-R', 2),
 ('Water polo', 3),
 ('Archery', 3),
 ('Basque Pelota', 3),
 ('Cricket', 3),
 ('Croquet', 3),
 ('Jumping', 4),
 ('Football', 4),
 ('Golf', 4),
 ('Polo', 4),
 ('Rowing', 4),
 ('Rugby', 5),
 ('Sailing', 5),
 ('Tug of War', 5),
 ('Diving', 5),
 ('Boxing', 5),
 ('Lacrosse', 6),
 ('Roque', 6),
 ('Wrestling Free.', 6),
 ('Hockey', 6),
 ('Jeu de Paume', 6),
 ('Rackets', 7),
 ('Figure skating', 7),
 ('Water Motorspor', 7),
 ('Dressage', 7),
 ('Eventing', 7),
 ('Modern Pentath.', 8),
 ('Vaulting', 8),
 ('Ice Hockey', 8),
 ('Basketball', 8),
 ('Canoe / Kayak F', 9),
 ('Handball', 9),
 ('Judo', 9),
 ('Volleyball', 9),
 ('Canoe / Kayak S', 10),
 ('Synchronized S.', 10),
 ('Rhythmic G.', 10),
 ('Table Tennis', 10),
 ('Badminton', 11),
 ('Baseball', 11),
 ('Mountain Bike', 11),
 ('Softball', 11),
 ('Beach volley.', 12),
 ('Trampoline', 12),
 ('Taekwondo', 12),
 ('Triathlon', 12),
 ('BMX', 13),
 ('Marathon swimming', 13),
 ('Synchronized Swimming', 13),
 ('Water Polo', 13),
 ('Canoe Slalom', 14),
 ('Canoe Sprint', 14),
 ('Cycling BMX', 14),
 ('Gymnastics Artistic', 14),
 ('Gymnastics Rhythmic', 15),
 ('Modern Pentathlon', 15),
 ('Beach Volleyball', 15),
 ('Wrestling Freestyle', 15)]

In [88]:
%%sql
WITH d_discline AS (
  SELECT
    DISTINCT Discipline
  FROM summer
)
SELECT
  Discipline,
  NTILE(15) OVER() AS page
FROM d_discline
ORDER BY page;

 * sqlite://
Done.

[('Swimming', 1),
 ('Athletics', 1),
 ('Cycling Road', 1),
 ('Cycling Track', 1),
 ('Fencing', 1),
 ('Artistic G.', 2),
 ('Shooting', 2),
 ('Tennis', 2),
 ('Weightlifting', 2),
 ('Wrestling Gre-R', 2),
 ('Water polo', 3),
 ('Archery', 3),
 ('Basque Pelota', 3),
 ('Cricket', 3),
 ('Croquet', 3),
 ('Jumping', 4),
 ('Football', 4),
 ('Golf', 4),
 ('Polo', 4),
 ('Rowing', 4),
 ('Rugby', 5),
 ('Sailing', 5),
 ('Tug of War', 5),
 ('Diving', 5),
 ('Boxing', 5),
 ('Lacrosse', 6),
 ('Roque', 6),
 ('Wrestling Free.', 6),
 ('Hockey', 6),
 ('Jeu de Paume', 6),
 ('Rackets', 7),
 ('Figure skating', 7),
 ('Water Motorspor', 7),
 ('Dressage', 7),
 ('Eventing', 7),
 ('Modern Pentath.', 8),
 ('Vaulting', 8),
 ('Ice Hockey', 8),
 ('Basketball', 8),
 ('Canoe / Kayak F', 9),
 ('Handball', 9),
 ('Judo', 9),
 ('Volleyball', 9),
 ('Canoe / Kayak S', 10),
 ('Synchronized S.', 10),
 ('Rhythmic G.', 10),
 ('Table Tennis', 10),
 ('Badminton', 11),
 ('Baseball', 11),
 ('Mountain Bike', 11),
 ('Softball', 11),
 ('Beach volley.', 12),
 ('Trampoline', 12),
 ('Taekwondo', 12),
 ('Triathlon', 12),
 ('BMX', 13),
 ('Marathon swimming', 13),
 ('Synchronized Swimming', 13),
 ('Water Polo', 13),
 ('Canoe Slalom', 14),
 ('Canoe Sprint', 14),
 ('Cycling BMX', 14),
 ('Gymnastics Artistic', 14),
 ('Gymnastics Rhythmic', 15),
 ('Modern Pentathlon', 15),
 ('Beach Volleyball', 15),
 ('Wrestling Freestyle', 15)]

In [89]:
%%sql
WITH count_medal AS (
  SELECT Country,
         COUNT(*) AS medal
  FROM summer
  GROUP BY Country
)

SELECT
  Country, medal,
  NTILE(3) OVER(ORDER BY medal DESC) AS page
FROM count_medal;

 * sqlite://
Done.

[('USA', 4585, 1),
 ('URS', 2049, 1),
 ('GBR', 1720, 1),
 ('FRA', 1396, 1),
 ('GER', 1305, 1),
 ('ITA', 1296, 1),
 ('AUS', 1189, 1),
 ('HUN', 1079, 1),
 ('SWE', 1044, 1),
 ('NED', 851, 1),
 ('GDR', 825, 1),
 ('CHN', 807, 1),
 ('JPN', 788, 1),
 ('RUS', 768, 1),
 ('CAN', 649, 1),
 ('ROU', 640, 1),
 ('NOR', 554, 1),
 ('KOR', 529, 1),
 ('POL', 511, 1),
 ('DEN', 507, 1),
 ('FRG', 490, 1),
 ('FIN', 456, 1),
 ('ESP', 442, 1),
 ('YUG', 435, 1),
 ('BRA', 431, 1),
 ('BEL', 411, 1),
 ('CUB', 410, 1),
 ('SUI', 380, 1),
 ('BUL', 333, 1),
 ('TCH', 329, 1),
 ('EUA', 260, 1),
 ('ARG', 259, 1),
 ('EUN', 223, 1),
 ('NZL', 190, 1),
 ('IND', 184, 1),
 ('UKR', 173, 1),
 ('GRE', 148, 1),
 ('AUT', 146, 1),
 ('JAM', 127, 1),
 ('PAK', 121, 1),
 ('CRO', 114, 1),
 ('BLR', 113, 1),
 ('MEX', 106, 1),
 ('RSA', 106, 1),
 ('KEN', 93, 1),
 ('TUR', 86, 1),
 ('NGR', 84, 1),
 ('URU', 76, 1),
 ('IRI', 61, 1),
 ('PRK', 58, 1),
 ('CZE', 56, 2),
 ('LTU', 55, 2),
 ('KAZ', 49, 2),
 ('ZZX', 48, 2),
 ('ETH', 45, 2),
 ('TPE', 44, 2),
 ('EST', 39, 2),
 ('INA', 38, 2),
 ('SVK', 34, 2),
 ('CHI', 33, 2),
 ('POR', 33, 2),
 ('SRB', 31, 2),
 ('IRL', 30, 2),
 ('ANZ', 29, 2),
 ('EGY', 28, 2),
 ('BAH', 27, 2),
 ('AZE', 26, 2),
 ('SLO', 26, 2),
 ('GEO', 25, 2),
 ('THA', 25, 2),
 ('MGL', 24, 2),
 ('CMR', 23, 2),
 ('ZIM', 23, 2),
 ('MAR', 22, 2),
 ('LAT', 20, 2),
 ('TRI', 20, 2),
 ('UZB', 20, 2),
 ('COL', 19, 2),
 ('ISL', 17, 2),
 ('PAR', 17, 2),
 ('RU1', 17, 2),
 ('GHA', 16, 2),
 ('ALG', 15, 2),
 ('PER', 15, 2),
 ('MNE', 14, 2),
 ('SCG', 14, 2),
 ('VEN', 12, 2),
 ('ARM', 11, 2),
 ('TTO', 10, 2),
 ('TUN', 10, 2),
 ('PHI', 9, 2),
 ('HAI', 8, 2),
 ('MAS', 8, 2),
 ('PUR', 8, 2),
 ('BOH', 7, 2),
 ('ISR', 7, 2),
 ('UGA', 7, 2),
 ('DOM', 6, 2),
 ('KSA', 6, 2),
 ('MDA', 6, 3),
 ('BWI', 5, 3),
 (None, 4, 3),
 ('CRC', 4, 3),
 ('HKG', 4, 3),
 ('LIB', 4, 3),
 ('NAM', 4, 3),
 ('QAT', 4, 3),
 ('SGP', 4, 3),
 ('SIN', 4, 3),
 ('IOP', 3, 3),
 ('KGZ', 3, 3),
 ('PAN', 3, 3),
 ('SYR', 3, 3),
 ('TJK', 3, 3),
 ('AFG', 2, 3),
 ('ECU', 2, 3),
 ('KUW', 2, 3),
 ('LUX', 2, 3),
 ('MOZ', 2, 3),
 ('SRI', 2, 3),
 ('SUR', 2, 3),
 ('TAN', 2, 3),
 ('VIE', 2, 3),
 ('ZAM', 2, 3),
 ('AHO', 1, 3),
 ('BAR', 1, 3),
 ('BDI', 1, 3),
 ('BER', 1, 3),
 ('BOT', 1, 3),
 ('BRN', 1, 3),
 ('CIV', 1, 3),
 ('CYP', 1, 3),
 ('DJI', 1, 3),
 ('ERI', 1, 3),
 ('GAB', 1, 3),
 ('GRN', 1, 3),
 ('GUA', 1, 3),
 ('GUY', 1, 3),
 ('IRQ', 1, 3),
 ('ISV', 1, 3),
 ('MKD', 1, 3),
 ('MRI', 1, 3),
 ('NIG', 1, 3),
 ('SEN', 1, 3),
 ('SUD', 1, 3),
 ('TGA', 1, 3),
 ('TOG', 1, 3),
 ('UAE', 1, 3)]

In [90]:
%%sql
WITH count_medal AS (
  SELECT Country,
         COUNT(*) AS medal
  FROM summer
  GROUP BY Country
),
third AS (
  SELECT
    Country, medal,
    NTILE(3) OVER(ORDER BY medal DESC) AS third
  FROM count_medal
)

SELECT
  third,
  ROUND(AVG(medal), 2) AS avg_medal
FROM third
GROUP BY third
ORDER BY third;

 * sqlite://
Done.

[(1, 598.74), (2, 22.98), (3, 2.08)]

#### Part 2 (*`OVER` Window function*)

In [91]:
%%sql
SELECT
  Year,
  COUNT(*) AS Medals
FROM summer
WHERE Medal='Gold'
AND Country='BRA'
AND Year >= 1992
GROUP BY Year
ORDER BY Year;

 * sqlite://
Done.

[(1992, 13), (1996, 5), (2004, 18), (2008, 14), (2012, 14)]

In [92]:
%%sql
WITH br_medals AS (
  SELECT
    Year,
    COUNT(*) AS Medals
  FROM summer
  WHERE Medal='Gold'
  AND Country='BRA'
  AND Year >= 1992
  GROUP BY Year
  ORDER BY Year
)

SELECT MAX(Medals) AS max_medals,
       MIN(Medals) AS min_medals,
       SUM(Medals) AS sum_medal
FROM br_medals;

 * sqlite://
Done.

[(18, 5, 64)]

In [93]:
%%sql
WITH br_medals AS (
  SELECT
    Year,
    COUNT(*) AS Medals
  FROM summer
  WHERE Medal='Gold'
  AND Country='BRA'
  AND Year >= 1992
  GROUP BY Year
  ORDER BY Year
)

SELECT
  Year, Medals,
  MAX(Medals)
    OVER(ORDER BY Year) AS max_medals
FROM br_medals;

 * sqlite://
Done.

[(1992, 13, 13), (1996, 5, 13), (2004, 18, 18), (2008, 14, 18), (2012, 14, 18)]

In [94]:
%%sql
WITH br_medals AS (
  SELECT
    Year,
    COUNT(*) AS Medals
  FROM summer
  WHERE Medal='Gold'
  AND Country='BRA'
  AND Year >= 1992
  GROUP BY Year
  ORDER BY Year
)

SELECT
  Year, Medals,
  SUM(Medals)
    OVER(ORDER BY Year) AS sum_medals,
  MAX(Medals)
    OVER(ORDER BY Year) AS max_medals
FROM br_medals;

 * sqlite://
Done.

[(1992, 13, 13, 13),
 (1996, 5, 18, 13),
 (2004, 18, 36, 18),
 (2008, 14, 50, 18),
 (2012, 14, 64, 18)]

In [95]:
%%sql
WITH br_medals AS (
  SELECT
    Year,
    Country,
    COUNT(*) AS Medals
  FROM summer
  WHERE Medal='Gold'
  AND Country IN ('BRA', 'CUB')
  AND Year >= 1992
  GROUP BY Year
  ORDER BY Year
)

SELECT
  Country, Year, Medals,
  SUM(Medals)
    OVER(PARTITION BY Country) AS sum_medals,
  MAX(Medals)
    OVER(PARTITION BY Country) AS max_medals
FROM br_medals;

 * sqlite://
Done.

[('BRA', 2008, 16, 16, 16),
 ('CUB', 1992, 57, 191, 57),
 ('CUB', 1996, 44, 191, 57),
 ('CUB', 2000, 22, 191, 57),
 ('CUB', 2004, 49, 191, 57),
 ('CUB', 2012, 19, 191, 57)]

In [96]:
%%sql
SELECT
  Year,
  COUNT(*) AS Medals
FROM summer
WHERE Medal='Gold'
AND Country='RUS'
GROUP BY Year
ORDER BY Year;

 * sqlite://
Done.

[(1996, 36), (2000, 66), (2004, 47), (2008, 43), (2012, 47)]

In [98]:
%%sql
WITH rus_medals AS (
  SELECT
    Year,
    COUNT(*) AS Medals
  FROM summer
  WHERE Medal='Gold'
  AND Country='RUS'
  GROUP BY Year
  ORDER BY Year
)

SELECT
  Year, Medals,
  MAX(Medals)
    OVER(ORDER BY Year) AS max_medals,
  MIN(Medals)
    OVER(ORDER BY Year) AS min_medals
FROM rus_medals
ORDER BY Year;

 * sqlite://
Done.

[(1996, 36, 36, 36),
 (2000, 66, 66, 36),
 (2004, 47, 66, 36),
 (2008, 43, 66, 36),
 (2012, 47, 66, 36)]

In [100]:
%%sql
WITH rus_medals AS (
  SELECT
    Year,
    COUNT(*) AS Medals
  FROM summer
  WHERE Medal='Gold'
  AND Country='RUS'
  GROUP BY Year
  ORDER BY Year
)

SELECT
  Year, Medals,
  MAX(Medals)
    OVER(ORDER BY Year) AS max_medals,
  MAX(Medals)
    OVER(ORDER BY Year
    ROWS BETWEEN
    1 PRECEDING
    AND CURRENT ROW) AS f_max_medals
FROM rus_medals
ORDER BY Year;

 * sqlite://
Done.

[(1996, 36, 36, 36),
 (2000, 66, 66, 66),
 (2004, 47, 66, 66),
 (2008, 43, 66, 47),
 (2012, 47, 66, 47)]

In [103]:
%%sql
WITH rus_medals AS (
  SELECT
    Year,
    COUNT(*) AS Medals
  FROM summer
  WHERE Medal='Gold'
  AND Country='RUS'
  GROUP BY Year
  ORDER BY Year
)

SELECT
  Year, Medals,
  MAX(Medals)
    OVER(ORDER BY Year) AS max_medals,
  MAX(Medals)
    OVER(ORDER BY Year
    ROWS BETWEEN
    1 PRECEDING
    AND CURRENT ROW) AS f_max_medals,
  MAX(Medals)
    OVER(ORDER BY Year
    ROWS BETWEEN
    CURRENT ROW
    AND 1 FOLLOWING) AS f_max_medals2
FROM rus_medals
ORDER BY Year;

 * sqlite://
Done.

[(1996, 36, 36, 36, 66),
 (2000, 66, 66, 66, 66),
 (2004, 47, 66, 66, 47),
 (2008, 43, 66, 47, 47),
 (2012, 47, 66, 47, 47)]